In [1]:
from getpass import getpass

user = input("Enter username: ")
password = getpass("Enter password: ")

Enter username: root
Enter password: ········

In [2]:
from getpass import getpass
from mysql.connector import connect, Error

try:
    with connect(
        host="localhost",
        user=user,
        password=password,
    ) as connection:
        print(connection)
except Error as e:
    print(e)

Authentication plugin 'caching_sha2_password' is not supported

In [3]:
import pyodbc
pyodbc.drivers()

['SQL Server',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)',
 'SQL Server Native Client 11.0',
 'MySQL ODBC 8.0 ANSI Driver',
 'MySQL ODBC 8.0 Unicode Driver',
 'ODBC Driver 17 for SQL Server']

In [4]:
import pyodbc
password=password
conn = pyodbc.connect('DRIVER={MySQL ODBC 8.0 Unicode Driver};SERVER=localhost;DATABASE=test;UID=root;PWD='+ password)

cursor = conn.cursor()

In [5]:
import pandas as pd
# select command
query = ''' SELECT * FROM loan''';
data = pd.read_sql(query, conn)
data.head()

,Sr_num,SeriousDlqin2yrs,RevUtilizOfUnsecL,Age,NumOf30_59DaysPastDue,DebtRatio,MthlyIncome,NumOfOpenCreditLLoans,NumOf90DaysLate,NumRealEstateLoansL,NumOf60_89DaysPastDue,NumOfDependents,Obs_Type
0,1.0,1.0,0.766127,45.0,2.0,0.802982,9120.0,13.0,0.0,6.0,0.0,2.0,TR
1,2.0,0.0,0.957151,40.0,0.0,0.121876,2600.0,4.0,0.0,0.0,0.0,1.0,TR
2,3.0,0.0,0.658180,38.0,1.0,0.085113,3042.0,2.0,1.0,0.0,0.0,0.0,TR
3,4.0,0.0,0.233810,30.0,0.0,0.036050,3300.0,5.0,0.0,0.0,0.0,0.0,TR
4,5.0,0.0,0.907239,49.0,1.0,0.024926,63588.0,7.0,0.0,1.0,0.0,0.0,TR

In [6]:
cursor.execute('''
 DROP TABLE IF EXISTS PeopleInfo;
               ''')

conn.commit()

In [7]:
cursor.execute('''
 CREATE TABLE IF NOT EXISTS PeopleInfo (
        PersonId INTEGER PRIMARY KEY,
        FirstName TEXT NOT NULL,
        LastName  TEXT NOT NULL,
        Age INTEGER NULL
 
);
               ''')

conn.commit()

In [8]:
cursor.execute('''
                INSERT INTO PeopleInfo (PersonId, FirstName, LastName, Age)
                VALUES
                (1,'Bob','Smith', 55),
                (2, 'Jenny','Smith', 66)
                ''')
conn.commit()

In [9]:
cursor.execute('SELECT * FROM PeopleInfo')
for row in cursor:
    print(row)

(1, 'Bob', 'Smith', 55)
(2, 'Jenny', 'Smith', 66)

In [10]:
query = ''' SELECT * FROM PeopleInfo''';
data = pd.read_sql(query, conn)
data.head()

   PersonId FirstName LastName  Age
0         1       Bob    Smith   55
1         2     Jenny    Smith   66

In [11]:
from getpass import getpass
import pyodbc
password=password
conn = pyodbc.connect('DRIVER={MySQL ODBC 8.0 Unicode Driver};SERVER=localhost;DATABASE=test;UID=root;PWD='+ password, autocommit=True)
cursor = conn.cursor()

In [12]:
cursor.execute('''
 DROP DATABASE IF EXISTS test;
               ''')

In [13]:
cursor.execute("create database test")

In [14]:
password=password
conn = pyodbc.connect('DRIVER={MySQL ODBC 8.0 Unicode Driver};SERVER=localhost;DATABASE=test;UID=root;PWD='+ password, autocommit=True)
cursor = conn.cursor()

In [15]:
cursor.execute('''
 DROP TABLE IF EXISTS PeopleInfo;
               ''')

In [16]:
cursor.execute('''
 CREATE TABLE IF NOT EXISTS PeopleInfo (
        PersonId INTEGER PRIMARY KEY,
        FirstName TEXT NOT NULL,
        LastName  TEXT NOT NULL,
        Age INTEGER NULL
 
);
               ''')

In [17]:
cursor.execute('''
                INSERT INTO PeopleInfo (PersonId, FirstName, LastName, Age)
                VALUES
                (1,'Bob','Smith', 55),
                (2, 'Jenny','Smith', 66)
                ''')

In [18]:
cursor.execute('SELECT * FROM PeopleInfo')
for row in cursor:
    print(row)

(1, 'Bob', 'Smith', 55)
(2, 'Jenny', 'Smith', 66)

In [19]:
query = ''' SELECT * FROM PeopleInfo''';
data = pd.read_sql(query, conn)
data.head()

   PersonId FirstName LastName  Age
0         1       Bob    Smith   55
1         2     Jenny    Smith   66

In [20]:
import pandas as pd

# Create dataframe
data = pd.DataFrame({
    'book_id':[12345,12346,12347],
    'title':['Python Programming','Learn MySQL','Data Science Cookbook'],
    'price':[29,23,27]
})

data

   book_id                  title  price
0    12345     Python Programming     29
1    12346            Learn MySQL     23
2    12347  Data Science Cookbook     27

In [21]:
df = pd.read_csv("CW1_credit_data_cleaned.csv")

In [22]:
from sqlalchemy import create_engine

In [23]:
import pymysql
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=password,
                               db="test"))

In [24]:
df.to_sql('loan', con = engine, if_exists = 'replace', index = False)

In [25]:
connection = pymysql.connect(host='localhost',
                             user='root',
                             password=password,
                             db='test')

In [26]:
cursor = connection.cursor()

In [27]:
sqlQuery = "CREATE TABLE Employee(EmployeeID int, Ename varchar(32), DeptID int, Salary int, Dname varchar(32), Dlocation varchar(32))"

In [28]:
cursor.execute(sqlQuery)

0

In [29]:
sql = "INSERT INTO `employee` (`EmployeeID`, `Ename`, `DeptID`, `Salary`, `Dname`, `Dlocation`) VALUES (%s, %s, %s, %s, %s, %s)"

In [30]:
cursor.execute(sql, (1008,'Kabir',2,5000,'IT','New Delhi'))

1

In [31]:
sqlQuery = "show tables"

In [32]:
cursor.execute(sqlQuery)

3

In [33]:
rows = cursor.fetchall()

for row in rows:
    print(row)

('employee',)
('loan',)
('peopleinfo',)

In [34]:
sqlQuery = "DROP DATABASE IF EXISTS "+ "db"

In [35]:
cursor.execute(sqlQuery)

0

In [36]:
sqlQuery = "CREATE DATABASE "+ "db"

In [37]:
cursor.execute(sqlQuery)

1

In [38]:
sqlQuery = "SHOW DATABASES"

In [39]:
cursor.execute(sqlQuery)

8

In [40]:
databaseList = cursor.fetchall()
 
for datatbase in databaseList:
    print(datatbase)

('db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('world',)

In [41]:
sqlQuery = "DROP DATABASE IF EXISTS "+ "data"

In [42]:
cursor.execute(sqlQuery)

0

In [43]:
sqlQuery = "SHOW DATABASES"

In [44]:
cursor.execute(sqlQuery)

8

In [45]:
databaseList = cursor.fetchall()
 
for datatbase in databaseList:
    print(datatbase)

('db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('world',)

In [46]:
sqlQuery = "DROP DATABASE IF EXISTS "+ "db"

In [47]:
cursor.execute(sqlQuery)

0

In [48]:
sqlQuery = "SHOW DATABASES"

In [49]:
cursor.execute(sqlQuery)

7

In [50]:
databaseList = cursor.fetchall()
 
for datatbase in databaseList:
    print(datatbase)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('world',)

In [51]:
cursor.execute("SELECT * from employee")

1

In [52]:
result = cursor.fetchall()

In [53]:
for i in result:
    print(i)

(1008, 'Kabir', 2, 5000, 'IT', 'New Delhi')

In [54]:
cursor.execute("SELECT * FROM employee WHERE DeptID=2")

1

In [55]:
result = cursor.fetchall()

In [56]:
for i in result:
    print(i)

(1008, 'Kabir', 2, 5000, 'IT', 'New Delhi')